function Golden_section(a0,a1,a2,b0,b1,b2,b3,b4,z0,z1,z2)

gr = (sqrt(5)+1)/2
	τ₀ = 0.0;
	τ₁ = 2.0;
	

	while(abs(τ₁-τ₀)>10^-8);

 			c = τ₁ -(τ₁-τ₀)/gr;
	 	
 			s =  1.0/sqrt(c^2*z2+(1-c)*c*z1+(1-c)^2*z0);
			f_c = 1/2*( s^2*( (1-c)^2*a0+(1-c)*c*a1+c^2*a2) + s^4*( (1-c)^4*b0+(1-c)^3*c*b1+(1-c)^2*c^2*b2+(1-c)*c^3*b3+c^4*b4 ) );
	 	
 			d = τ₀ +(τ₁-τ₀)/gr;

 			s =  1.0/sqrt(d^2*z2+(1-d)*d*z1+(1-d)^2*z0);
			f_d = 1/2*( s^2*( (1-d)^2*a0+(1-d)*d*a1+d^2*a2) + s^4*( (1-d)^4*b0+(1-d)^3*d*b1+(1-d)^2*d^2*b2+(1-d)*d^3*b3+d^4*b4 ) );

	 	
			if(f_c<f_d)
				τ₁ = d;
			else
				τ₀ = c;
			end
		end
		
	
	
	τ = (τ₀+τ₁)/2.0;
	
	s =  1.0/sqrt(τ ^2*z2+(1-τ )*τ *z1+(1-τ )^2*z0);
	f_τ  = 1/2*( s^2*( (1-τ )^2*a0+(1-τ )*τ *a1+τ ^2*a2) + s^4*( (1-τ )^4*b0+(1-τ )^3*τ *b1+(1-τ )^2*τ ^2*b2+(1-τ )*τ ^3*b3+τ ^4*b4 ) );

	opt = 2*f_τ ;


return τ, opt

end
